# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Command-line fuzzy finder written in Go
brew "fzf"
# Insanely fast image printing in your terminal
brew "catimg"
# Command-line hex viewer
brew "hexyl"
# Clean Docker containers, images, networks, and volumes
# brew "docker-clean"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Mac App Store command-line interface
brew "mas"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Lightweight and flexible command-line JSON processor
brew "jq"
# YAML Parser
brew "libyaml"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Python version management
brew "pyenv"
# Intuitive find & replace CLI
brew "sd"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Code-search similar to ack
brew "the_silver_searcher"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Pack repository contents into a single AI-friendly file
brew "repomix"
# RDBS
brew "postgresql"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Show ps output as a tree
brew "pstree"
# Persistent key-value database, with built-in net interface
brew "redis"
# Voice and text chat software
cask "discord"
# Another Redis Desktop Manager
cask "another-redis-desktop-manager"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Collaboration platform for API development
cask "postman"
# App to build and share containerised applications and microservices
# cask "docker"
# Web browser
cask "google-chrome"
# Terminal built on web technologies
cask "hyper"
# Desktop shield and keystroke interceptor
cask "keyboard-cleaner"
# Clipboard manager
cask "clipy"
# Quicklook extension for source files
cask "syntax-highlight"
# Messaging app with a focus on speed and security
cask "telegram"
# Video communication and virtual meeting platform
cask "zoom"
# Python IDE
cask "pycharm"

# AppStore related apps
mas "Delete Apps", id: 1033808943
